mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/common/s6e2c2xh.h
typedef struct stc_ethernet_mac_tdlar_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  STL                  :30;
        };
        struct {
            __IO  uint32_t  RESERVED1            :2;
            __IO  uint32_t  STL0                 :1;
            __IO  uint32_t  STL1                 :1;
            __IO  uint32_t  STL2                 :1;
            __IO  uint32_t  STL3                 :1;
            __IO  uint32_t  STL4                 :1;
            __IO  uint32_t  STL5                 :1;
            __IO  uint32_t  STL6                 :1;
            __IO  uint32_t  STL7                 :1;
            __IO  uint32_t  STL8                 :1;
            __IO  uint32_t  STL9                 :1;
            __IO  uint32_t  STL10                :1;
            __IO  uint32_t  STL11                :1;
            __IO  uint32_t  STL12                :1;
            __IO  uint32_t  STL13                :1;
            __IO  uint32_t  STL14                :1;
            __IO  uint32_t  STL15                :1;
            __IO  uint32_t  STL16                :1;
            __IO  uint32_t  STL17                :1;
            __IO  uint32_t  STL18                :1;
            __IO  uint32_t  STL19                :1;
            __IO  uint32_t  STL20                :1;
            __IO  uint32_t  STL21                :1;
            __IO  uint32_t  STL22                :1;
            __IO  uint32_t  STL23                :1;
            __IO  uint32_t  STL24                :1;
            __IO  uint32_t  STL25                :1;
            __IO  uint32_t  STL26                :1;
            __IO  uint32_t  STL27                :1;
            __IO  uint32_t  STL28                :1;
            __IO  uint32_t  STL29                :1;
        };
    };
} stc_ethernet_mac_tdlar_field_t;

typedef struct stc_ethernet_mac_sr_field
{
    union {
        struct {
            __IO  uint32_t  TI                   :1;
            __IO  uint32_t  TPS                  :1;
            __IO  uint32_t  TU                   :1;
            __IO  uint32_t  TJT                  :1;
            __IO  uint32_t  OVF                  :1;
            __IO  uint32_t  UNF                  :1;
            __IO  uint32_t  RI                   :1;
            __IO  uint32_t  RU                   :1;
            __IO  uint32_t  RPS                  :1;
            __IO  uint32_t  RWT                  :1;
            __IO  uint32_t  ETI                  :1;
            __IO  uint32_t  RESERVED0            :2;
            __IO  uint32_t  FBI                  :1;
            __IO  uint32_t  ERI                  :1;
            __IO  uint32_t  AIS                  :1;
            __IO  uint32_t  NIS                  :1;
            __IO  uint32_t  RS                   :3;
            __IO  uint32_t  TS                   :3;
            __IO  uint32_t  EB                   :3;
            __IO  uint32_t  GLI                  :1;
            __IO  uint32_t  GMI                  :1;
            __IO  uint32_t  GPI                  :1;
            __IO  uint32_t  TTI                  :1;
            __IO  uint32_t  GLPII                :1;
            __IO  uint32_t  RESERVED2            :1;
        };
        struct {
            __IO  uint32_t  RESERVED1            :17;
            __IO  uint32_t  RS0                  :1;
            __IO  uint32_t  RS1                  :1;
            __IO  uint32_t  RS2                  :1;
            __IO  uint32_t  TS0                  :1;
            __IO  uint32_t  TS1                  :1;
            __IO  uint32_t  TS2                  :1;
            __IO  uint32_t  EB0                  :1;
            __IO  uint32_t  EB1                  :1;
            __IO  uint32_t  EB2                  :1;
            __IO  uint32_t  RESERVED3            :6;
        };
    };
} stc_ethernet_mac_sr_field_t;

typedef struct stc_ethernet_mac_omr_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  SR                   :1;
            __IO  uint32_t  OSF                  :1;
            __IO  uint32_t  RTC                  :2;
            __IO  uint32_t  RESERVED2            :1;
            __IO  uint32_t  FUF                  :1;
            __IO  uint32_t  FEF                  :1;
            __IO  uint32_t  RESERVED3            :5;
            __IO  uint32_t  ST                   :1;
            __IO  uint32_t  TTC                  :3;
            __IO  uint32_t  RESERVED5            :3;
            __IO  uint32_t  FTF                  :1;
            __IO  uint32_t  TSF                  :1;
            __IO  uint32_t  RESERVED6            :2;
            __IO  uint32_t  DFF                  :1;
            __IO  uint32_t  RSF                  :1;
            __IO  uint32_t  DT                   :1;
            __IO  uint32_t  RESERVED7            :5;
        };
        struct {
            __IO  uint32_t  RESERVED1            :3;
            __IO  uint32_t  RTC0                 :1;
            __IO  uint32_t  RTC1                 :1;
            __IO  uint32_t  RESERVED4            :9;
            __IO  uint32_t  TTC0                 :1;
            __IO  uint32_t  TTC1                 :1;
            __IO  uint32_t  TTC2                 :1;
            __IO  uint32_t  RESERVED8            :15;
        };
    };
} stc_ethernet_mac_omr_field_t;

typedef struct stc_ethernet_mac_ier_field
{
        __IO  uint32_t  TIE                      :1;
        __IO  uint32_t  TSE                      :1;
        __IO  uint32_t  TUE                      :1;
        __IO  uint32_t  TJE                      :1;
        __IO  uint32_t  OVE                      :1;
        __IO  uint32_t  UNE                      :1;
        __IO  uint32_t  RIE                      :1;
        __IO  uint32_t  RUE                      :1;
        __IO  uint32_t  RSE                      :1;
        __IO  uint32_t  RWE                      :1;
        __IO  uint32_t  ETE                      :1;
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  FBE                      :1;
        __IO  uint32_t  ERE                      :1;
        __IO  uint32_t  AIE                      :1;
        __IO  uint32_t  NIE                      :1;
        __IO  uint32_t  RESERVED1                :15;
} stc_ethernet_mac_ier_field_t;

typedef struct stc_ethernet_mac_mfbocr_field
{
    union {
        struct {
            __IO  uint32_t  NMFH                 :16;
            __IO  uint32_t  ONMFH                :1;
            __IO  uint32_t  NMFF                 :11;
            __IO  uint32_t  ONMFF                :1;
            __IO  uint32_t  RESERVED1            :3;
        };
        struct {
            __IO  uint32_t  NMFH0                :1;
            __IO  uint32_t  NMFH1                :1;
            __IO  uint32_t  NMFH2                :1;
            __IO  uint32_t  NMFH3                :1;
            __IO  uint32_t  NMFH4                :1;
            __IO  uint32_t  NMFH5                :1;
            __IO  uint32_t  NMFH6                :1;
            __IO  uint32_t  NMFH7                :1;
            __IO  uint32_t  NMFH8                :1;
            __IO  uint32_t  NMFH9                :1;
            __IO  uint32_t  NMFH10               :1;
            __IO  uint32_t  NMFH11               :1;
            __IO  uint32_t  NMFH12               :1;
            __IO  uint32_t  NMFH13               :1;
            __IO  uint32_t  NMFH14               :1;
            __IO  uint32_t  NMFH15               :1;
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  NMFF0                :1;
            __IO  uint32_t  NMFF1                :1;
            __IO  uint32_t  NMFF2                :1;
            __IO  uint32_t  NMFF3                :1;
            __IO  uint32_t  NMFF4                :1;
            __IO  uint32_t  NMFF5                :1;
            __IO  uint32_t  NMFF6                :1;
            __IO  uint32_t  NMFF7                :1;
            __IO  uint32_t  NMFF8                :1;
            __IO  uint32_t  NMFF9                :1;
            __IO  uint32_t  NMFF10               :1;
            __IO  uint32_t  RESERVED2            :4;
        };
    };
} stc_ethernet_mac_mfbocr_field_t;

