mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/common/s6e2c2xh.h
/*******************************************************************************
* USBETHERCLK_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t UCCR;
        stc_usbetherclk_uccr_field_t UCCR_f;
    };
        __IO  uint8_t RESERVED0[3];
    union {
        __IO  uint8_t UPCR1;
        stc_usbetherclk_upcr1_field_t UPCR1_f;
    };
        __IO  uint8_t RESERVED1[3];
    union {
        __IO  uint8_t UPCR2;
        stc_usbetherclk_upcr2_field_t UPCR2_f;
    };
        __IO  uint8_t RESERVED2[3];
    union {
        __IO  uint8_t UPCR3;
        stc_usbetherclk_upcr3_field_t UPCR3_f;
    };
        __IO  uint8_t RESERVED3[3];
    union {
        __IO  uint8_t UPCR4;
        stc_usbetherclk_upcr4_field_t UPCR4_f;
    };
        __IO  uint8_t RESERVED4[3];
    union {
        __IO  uint8_t UP_STR;
        stc_usbetherclk_up_str_field_t UP_STR_f;
    };
        __IO  uint8_t RESERVED5[3];
    union {
        __IO  uint8_t UPINT_ENR;
        stc_usbetherclk_upint_enr_field_t UPINT_ENR_f;
    };
        __IO  uint8_t RESERVED6[3];
    union {
        __IO  uint8_t UPINT_CLR;
        stc_usbetherclk_upint_clr_field_t UPINT_CLR_f;
    };
        __IO  uint8_t RESERVED7[3];
    union {
        __IO  uint8_t UPINT_STR;
        stc_usbetherclk_upint_str_field_t UPINT_STR_f;
    };
        __IO  uint8_t RESERVED8[3];
    union {
        __IO  uint8_t UPCR5;
        stc_usbetherclk_upcr5_field_t UPCR5_f;
    };
        __IO  uint8_t RESERVED9[3];
    union {
        __IO  uint8_t UPCR6;
        stc_usbetherclk_upcr6_field_t UPCR6_f;
    };
        __IO  uint8_t RESERVED10[3];
    union {
        __IO  uint8_t UPCR7;
        stc_usbetherclk_upcr7_field_t UPCR7_f;
    };
        __IO  uint8_t RESERVED11[3];
    union {
        __IO  uint8_t USBEN0;
        stc_usbetherclk_usben0_field_t USBEN0_f;
    };
        __IO  uint8_t RESERVED12[3];
    union {
        __IO  uint8_t USBEN1;
        stc_usbetherclk_usben1_field_t USBEN1_f;
    };
} FM_USBETHERCLK_TypeDef, FM4_USBETHERCLK_TypeDef;

/*******************************************************************************
* WC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO  uint8_t WCRD;
        stc_wc_wcrd_field_t WCRD_f;
    };
    union {
        __IO  uint8_t WCRL;
        stc_wc_wcrl_field_t WCRL_f;
    };
    union {
        __IO  uint8_t WCCR;
        stc_wc_wccr_field_t WCCR_f;
    };
        __IO  uint8_t RESERVED0[13];
    union {
        __IO uint16_t CLK_SEL;
        stc_wc_clk_sel_field_t CLK_SEL_f;
        struct {
            __IO  uint8_t CLK_SELL;
            __IO  uint8_t CLK_SELH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO  uint8_t CLK_EN;
        stc_wc_clk_en_field_t CLK_EN_f;
    };
} FM_WC_TypeDef, FM4_WC_TypeDef;

/*******************************************************************************
* Peripheral Memory Map
*******************************************************************************/
#define FM_FLASH_BASE                             (0x00000000UL) /* Flash Base Address */
#define FM4_FLASH_BASE                            (0x00000000UL) /* Flash Base Address */
#define FM_PERIPH_BASE                            (0x40000000UL) /* Peripheral Base Address */
#define FM4_PERIPH_BASE                           (0x40000000UL) /* Peripheral Base Address */
#define FM_CM4_BASE                               (0xE0100000UL) /* CM4 Private */
#define FM4_CM4_BASE                              (0xE0100000UL) /* CM4 Private  */

#define FM_ADC0_BASE                              (0x40027000UL) /* ADC0 Base Address */
#define FM4_ADC0_BASE                             (0x40027000UL) /* ADC0 Base Address */
#define FM_ADC1_BASE                              (0x40027100UL) /* ADC1 Base Address */
#define FM4_ADC1_BASE                             (0x40027100UL) /* ADC1 Base Address */
#define FM_ADC2_BASE                              (0x40027200UL) /* ADC2 Base Address */
#define FM4_ADC2_BASE                             (0x40027200UL) /* ADC2 Base Address */
#define FM_BT0_BASE                               (0x40025000UL) /* BT0 Base Address */
#define FM4_BT0_BASE                              (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PPG_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM4_BT0_PPG_BASE                          (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PWC_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM4_BT0_PWC_BASE                          (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_PWM_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM4_BT0_PWM_BASE                          (0x40025000UL) /* BT0 Base Address */
#define FM_BT0_RT_BASE                            (0x40025000UL) /* BT0 Base Address */
#define FM4_BT0_RT_BASE                           (0x40025000UL) /* BT0 Base Address */
#define FM_BT1_BASE                               (0x40025040UL) /* BT1 Base Address */
#define FM4_BT1_BASE                              (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PPG_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM4_BT1_PPG_BASE                          (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PWC_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM4_BT1_PWC_BASE                          (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_PWM_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM4_BT1_PWM_BASE                          (0x40025040UL) /* BT1 Base Address */
#define FM_BT1_RT_BASE                            (0x40025040UL) /* BT1 Base Address */
#define FM4_BT1_RT_BASE                           (0x40025040UL) /* BT1 Base Address */
#define FM_BT10_BASE                              (0x40025480UL) /* BT10 Base Address */
#define FM4_BT10_BASE                             (0x40025480UL) /* BT10 Base Address */
#define FM_BT10_PPG_BASE                          (0x40025480UL) /* BT10 Base Address */
#define FM4_BT10_PPG_BASE                         (0x40025480UL) /* BT10 Base Address */
#define FM_BT10_PWC_BASE                          (0x40025480UL) /* BT10 Base Address */
#define FM4_BT10_PWC_BASE                         (0x40025480UL) /* BT10 Base Address */
#define FM_BT10_PWM_BASE                          (0x40025480UL) /* BT10 Base Address */
#define FM4_BT10_PWM_BASE                         (0x40025480UL) /* BT10 Base Address */
#define FM_BT10_RT_BASE                           (0x40025480UL) /* BT10 Base Address */
#define FM4_BT10_RT_BASE                          (0x40025480UL) /* BT10 Base Address */
#define FM_BT11_BASE                              (0x400254C0UL) /* BT11 Base Address */
#define FM4_BT11_BASE                             (0x400254C0UL) /* BT11 Base Address */
#define FM_BT11_PPG_BASE                          (0x400254C0UL) /* BT11 Base Address */
#define FM4_BT11_PPG_BASE                         (0x400254C0UL) /* BT11 Base Address */
#define FM_BT11_PWC_BASE                          (0x400254C0UL) /* BT11 Base Address */
#define FM4_BT11_PWC_BASE                         (0x400254C0UL) /* BT11 Base Address */
#define FM_BT11_PWM_BASE                          (0x400254C0UL) /* BT11 Base Address */
#define FM4_BT11_PWM_BASE                         (0x400254C0UL) /* BT11 Base Address */
#define FM_BT11_RT_BASE                           (0x400254C0UL) /* BT11 Base Address */
#define FM4_BT11_RT_BASE                          (0x400254C0UL) /* BT11 Base Address */
#define FM_BT12_BASE                              (0x40025600UL) /* BT12 Base Address */
#define FM4_BT12_BASE                             (0x40025600UL) /* BT12 Base Address */
#define FM_BT12_PPG_BASE                          (0x40025600UL) /* BT12 Base Address */
#define FM4_BT12_PPG_BASE                         (0x40025600UL) /* BT12 Base Address */
#define FM_BT12_PWC_BASE                          (0x40025600UL) /* BT12 Base Address */
#define FM4_BT12_PWC_BASE                         (0x40025600UL) /* BT12 Base Address */
#define FM_BT12_PWM_BASE                          (0x40025600UL) /* BT12 Base Address */
#define FM4_BT12_PWM_BASE                         (0x40025600UL) /* BT12 Base Address */
#define FM_BT12_RT_BASE                           (0x40025600UL) /* BT12 Base Address */
#define FM4_BT12_RT_BASE                          (0x40025600UL) /* BT12 Base Address */
#define FM_BT13_BASE                              (0x40025640UL) /* BT13 Base Address */
#define FM4_BT13_BASE                             (0x40025640UL) /* BT13 Base Address */
#define FM_BT13_PPG_BASE                          (0x40025640UL) /* BT13 Base Address */
#define FM4_BT13_PPG_BASE                         (0x40025640UL) /* BT13 Base Address */
#define FM_BT13_PWC_BASE                          (0x40025640UL) /* BT13 Base Address */
#define FM4_BT13_PWC_BASE                         (0x40025640UL) /* BT13 Base Address */
#define FM_BT13_PWM_BASE                          (0x40025640UL) /* BT13 Base Address */
#define FM4_BT13_PWM_BASE                         (0x40025640UL) /* BT13 Base Address */
#define FM_BT13_RT_BASE                           (0x40025640UL) /* BT13 Base Address */
#define FM4_BT13_RT_BASE                          (0x40025640UL) /* BT13 Base Address */
#define FM_BT14_BASE                              (0x40025680UL) /* BT14 Base Address */
#define FM4_BT14_BASE                             (0x40025680UL) /* BT14 Base Address */
#define FM_BT14_PPG_BASE                          (0x40025680UL) /* BT14 Base Address */
#define FM4_BT14_PPG_BASE                         (0x40025680UL) /* BT14 Base Address */
#define FM_BT14_PWC_BASE                          (0x40025680UL) /* BT14 Base Address */
#define FM4_BT14_PWC_BASE                         (0x40025680UL) /* BT14 Base Address */
#define FM_BT14_PWM_BASE                          (0x40025680UL) /* BT14 Base Address */
#define FM4_BT14_PWM_BASE                         (0x40025680UL) /* BT14 Base Address */
#define FM_BT14_RT_BASE                           (0x40025680UL) /* BT14 Base Address */
#define FM4_BT14_RT_BASE                          (0x40025680UL) /* BT14 Base Address */
#define FM_BT15_BASE                              (0x400256C0UL) /* BT15 Base Address */
#define FM4_BT15_BASE                             (0x400256C0UL) /* BT15 Base Address */
#define FM_BT15_PPG_BASE                          (0x400256C0UL) /* BT15 Base Address */
#define FM4_BT15_PPG_BASE                         (0x400256C0UL) /* BT15 Base Address */
#define FM_BT15_PWC_BASE                          (0x400256C0UL) /* BT15 Base Address */
#define FM4_BT15_PWC_BASE                         (0x400256C0UL) /* BT15 Base Address */
#define FM_BT15_PWM_BASE                          (0x400256C0UL) /* BT15 Base Address */
#define FM4_BT15_PWM_BASE                         (0x400256C0UL) /* BT15 Base Address */
#define FM_BT15_RT_BASE                           (0x400256C0UL) /* BT15 Base Address */
#define FM4_BT15_RT_BASE                          (0x400256C0UL) /* BT15 Base Address */
#define FM_BT2_BASE                               (0x40025080UL) /* BT2 Base Address */
#define FM4_BT2_BASE                              (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PPG_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM4_BT2_PPG_BASE                          (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PWC_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM4_BT2_PWC_BASE                          (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_PWM_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM4_BT2_PWM_BASE                          (0x40025080UL) /* BT2 Base Address */
#define FM_BT2_RT_BASE                            (0x40025080UL) /* BT2 Base Address */
#define FM4_BT2_RT_BASE                           (0x40025080UL) /* BT2 Base Address */
#define FM_BT3_BASE                               (0x400250C0UL) /* BT3 Base Address */
#define FM4_BT3_BASE                              (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PPG_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM4_BT3_PPG_BASE                          (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PWC_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM4_BT3_PWC_BASE                          (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_PWM_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM4_BT3_PWM_BASE                          (0x400250C0UL) /* BT3 Base Address */
#define FM_BT3_RT_BASE                            (0x400250C0UL) /* BT3 Base Address */
#define FM4_BT3_RT_BASE                           (0x400250C0UL) /* BT3 Base Address */
#define FM_BT4_BASE                               (0x40025200UL) /* BT4 Base Address */
#define FM4_BT4_BASE                              (0x40025200UL) /* BT4 Base Address */
#define FM_BT4_PPG_BASE                           (0x40025200UL) /* BT4 Base Address */
#define FM4_BT4_PPG_BASE                          (0x40025200UL) /* BT4 Base Address */
#define FM_BT4_PWC_BASE                           (0x40025200UL) /* BT4 Base Address */
#define FM4_BT4_PWC_BASE                          (0x40025200UL) /* BT4 Base Address */
#define FM_BT4_PWM_BASE                           (0x40025200UL) /* BT4 Base Address */
#define FM4_BT4_PWM_BASE                          (0x40025200UL) /* BT4 Base Address */
#define FM_BT4_RT_BASE                            (0x40025200UL) /* BT4 Base Address */
#define FM4_BT4_RT_BASE                           (0x40025200UL) /* BT4 Base Address */
#define FM_BT5_BASE                               (0x40025240UL) /* BT5 Base Address */
#define FM4_BT5_BASE                              (0x40025240UL) /* BT5 Base Address */
#define FM_BT5_PPG_BASE                           (0x40025240UL) /* BT5 Base Address */
#define FM4_BT5_PPG_BASE                          (0x40025240UL) /* BT5 Base Address */
#define FM_BT5_PWC_BASE                           (0x40025240UL) /* BT5 Base Address */
#define FM4_BT5_PWC_BASE                          (0x40025240UL) /* BT5 Base Address */
#define FM_BT5_PWM_BASE                           (0x40025240UL) /* BT5 Base Address */
#define FM4_BT5_PWM_BASE                          (0x40025240UL) /* BT5 Base Address */
#define FM_BT5_RT_BASE                            (0x40025240UL) /* BT5 Base Address */
#define FM4_BT5_RT_BASE                           (0x40025240UL) /* BT5 Base Address */
#define FM_BT6_BASE                               (0x40025280UL) /* BT6 Base Address */
#define FM4_BT6_BASE                              (0x40025280UL) /* BT6 Base Address */
#define FM_BT6_PPG_BASE                           (0x40025280UL) /* BT6 Base Address */
#define FM4_BT6_PPG_BASE                          (0x40025280UL) /* BT6 Base Address */
#define FM_BT6_PWC_BASE                           (0x40025280UL) /* BT6 Base Address */
#define FM4_BT6_PWC_BASE                          (0x40025280UL) /* BT6 Base Address */
#define FM_BT6_PWM_BASE                           (0x40025280UL) /* BT6 Base Address */
#define FM4_BT6_PWM_BASE                          (0x40025280UL) /* BT6 Base Address */
#define FM_BT6_RT_BASE                            (0x40025280UL) /* BT6 Base Address */
#define FM4_BT6_RT_BASE                           (0x40025280UL) /* BT6 Base Address */
#define FM_BT7_BASE                               (0x400252C0UL) /* BT7 Base Address */
#define FM4_BT7_BASE                              (0x400252C0UL) /* BT7 Base Address */
#define FM_BT7_PPG_BASE                           (0x400252C0UL) /* BT7 Base Address */
#define FM4_BT7_PPG_BASE                          (0x400252C0UL) /* BT7 Base Address */
#define FM_BT7_PWC_BASE                           (0x400252C0UL) /* BT7 Base Address */
#define FM4_BT7_PWC_BASE                          (0x400252C0UL) /* BT7 Base Address */
#define FM_BT7_PWM_BASE                           (0x400252C0UL) /* BT7 Base Address */
#define FM4_BT7_PWM_BASE                          (0x400252C0UL) /* BT7 Base Address */
#define FM_BT7_RT_BASE                            (0x400252C0UL) /* BT7 Base Address */
#define FM4_BT7_RT_BASE                           (0x400252C0UL) /* BT7 Base Address */
#define FM_BT8_BASE                               (0x40025400UL) /* BT8 Base Address */
#define FM4_BT8_BASE                              (0x40025400UL) /* BT8 Base Address */
#define FM_BT8_PPG_BASE                           (0x40025400UL) /* BT8 Base Address */
#define FM4_BT8_PPG_BASE                          (0x40025400UL) /* BT8 Base Address */
#define FM_BT8_PWC_BASE                           (0x40025400UL) /* BT8 Base Address */
#define FM4_BT8_PWC_BASE                          (0x40025400UL) /* BT8 Base Address */
#define FM_BT8_PWM_BASE                           (0x40025400UL) /* BT8 Base Address */
#define FM4_BT8_PWM_BASE                          (0x40025400UL) /* BT8 Base Address */
#define FM_BT8_RT_BASE                            (0x40025400UL) /* BT8 Base Address */
#define FM4_BT8_RT_BASE                           (0x40025400UL) /* BT8 Base Address */
#define FM_BT9_BASE                               (0x40025440UL) /* BT9 Base Address */
#define FM4_BT9_BASE                              (0x40025440UL) /* BT9 Base Address */
#define FM_BT9_PPG_BASE                           (0x40025440UL) /* BT9 Base Address */
#define FM4_BT9_PPG_BASE                          (0x40025440UL) /* BT9 Base Address */
#define FM_BT9_PWC_BASE                           (0x40025440UL) /* BT9 Base Address */
#define FM4_BT9_PWC_BASE                          (0x40025440UL) /* BT9 Base Address */
#define FM_BT9_PWM_BASE                           (0x40025440UL) /* BT9 Base Address */
#define FM4_BT9_PWM_BASE                          (0x40025440UL) /* BT9 Base Address */
#define FM_BT9_RT_BASE                            (0x40025440UL) /* BT9 Base Address */
#define FM4_BT9_RT_BASE                           (0x40025440UL) /* BT9 Base Address */
#define FM_BTIOSEL03_BASE                         (0x40025100UL) /* BTIOSEL03 Base Address */
#define FM4_BTIOSEL03_BASE                        (0x40025100UL) /* BTIOSEL03 Base Address */
#define FM_BTIOSEL47_BASE                         (0x40025300UL) /* BTIOSEL47 Base Address */
#define FM4_BTIOSEL47_BASE                        (0x40025300UL) /* BTIOSEL47 Base Address */
#define FM_BTIOSEL8B_BASE                         (0x40025500UL) /* BTIOSEL8B Base Address */
#define FM4_BTIOSEL8B_BASE                        (0x40025500UL) /* BTIOSEL8B Base Address */
#define FM_BTIOSELCF_BASE                         (0x40025700UL) /* BTIOSELCF Base Address */
#define FM4_BTIOSELCF_BASE                        (0x40025700UL) /* BTIOSELCF Base Address */
#define FM_CLK_GATING_BASE                        (0x4003C100UL) /* CLK_GATING Base Address */
#define FM4_CLK_GATING_BASE                       (0x4003C100UL) /* CLK_GATING Base Address */
#define FM_CRC_BASE                               (0x40039000UL) /* CRC Base Address */
#define FM4_CRC_BASE                              (0x40039000UL) /* CRC Base Address */
#define FM_CRG_BASE                               (0x40010000UL) /* CRG Base Address */
#define FM4_CRG_BASE                              (0x40010000UL) /* CRG Base Address */
#define FM_CRTRIM_BASE                            (0x4002E000UL) /* CRTRIM Base Address */
#define FM4_CRTRIM_BASE                           (0x4002E000UL) /* CRTRIM Base Address */
#define FM_DAC0_BASE                              (0x40033000UL) /* DAC0 Base Address */
#define FM4_DAC0_BASE                             (0x40033000UL) /* DAC0 Base Address */
#define FM_DAC1_BASE                              (0x40033008UL) /* DAC1 Base Address */
#define FM4_DAC1_BASE                             (0x40033008UL) /* DAC1 Base Address */
#define FM_DMAC_BASE                              (0x40060000UL) /* DMAC Base Address */
#define FM4_DMAC_BASE                             (0x40060000UL) /* DMAC Base Address */
#define FM_DS_BASE                                (0x40035100UL) /* DS Base Address */
#define FM4_DS_BASE                               (0x40035100UL) /* DS Base Address */
#define FM_DSTC_BASE                              (0x40061000UL) /* DSTC Base Address */
#define FM4_DSTC_BASE                             (0x40061000UL) /* DSTC Base Address */
#define FM_DT_BASE                                (0x40015000UL) /* DT Base Address */
#define FM4_DT_BASE                               (0x40015000UL) /* DT Base Address */
#define FM_DUALFLASH_IF_BASE                      (0x40000400UL) /* DUALFLASH_IF Base Address */
#define FM4_DUALFLASH_IF_BASE                     (0x40000400UL) /* DUALFLASH_IF Base Address */
#define FM_ECC_CAPTURE_BASE                       (0x40000300UL) /* ECC_CAPTURE Base Address */
#define FM4_ECC_CAPTURE_BASE                      (0x40000300UL) /* ECC_CAPTURE Base Address */
#define FM_ETHERNET_CONTROL_BASE                  (0x40066000UL) /* ETHERNET_CONTROL Base Address */
#define FM4_ETHERNET_CONTROL_BASE                 (0x40066000UL) /* ETHERNET_CONTROL Base Address */
#define FM_ETHERNET_MAC0_BASE                     (0x40064000UL) /* ETHERNET_MAC0 Base Address */
#define FM4_ETHERNET_MAC0_BASE                    (0x40064000UL) /* ETHERNET_MAC0 Base Address */
#define FM_EXBUS_BASE                             (0x4003F000UL) /* EXBUS Base Address */
#define FM4_EXBUS_BASE                            (0x4003F000UL) /* EXBUS Base Address */
#define FM_EXTI_BASE                              (0x40030000UL) /* EXTI Base Address */
#define FM4_EXTI_BASE                             (0x40030000UL) /* EXTI Base Address */
#define FM_FLASH_IF_BASE                          (0x40000000UL) /* FLASH_IF Base Address */
#define FM4_FLASH_IF_BASE                         (0x40000000UL) /* FLASH_IF Base Address */
#define FM_GPIO_BASE                              (0x4006F000UL) /* GPIO Base Address */
#define FM4_GPIO_BASE                             (0x4006F000UL) /* GPIO Base Address */
#define FM_HSSPI_BASE                             (0xD0000000UL) /* HSSPI Base Address */
#define FM4_HSSPI_BASE                            (0xD0000000UL) /* HSSPI Base Address */
#define FM_HWWDT_BASE                             (0x40011000UL) /* HWWDT Base Address */
#define FM4_HWWDT_BASE                            (0x40011000UL) /* HWWDT Base Address */
#define FM_I2S0_BASE                              (0x4006C000UL) /* I2S0 Base Address */
#define FM4_I2S0_BASE                             (0x4006C000UL) /* I2S0 Base Address */
#define FM_I2SPRE_BASE                            (0x4003D000UL) /* I2SPRE Base Address */
#define FM4_I2SPRE_BASE                           (0x4003D000UL) /* I2SPRE Base Address */
#define FM_INTREQ_BASE                            (0x40031000UL) /* INTREQ Base Address */
#define FM4_INTREQ_BASE                           (0x40031000UL) /* INTREQ Base Address */
#define FM_LSCRP_BASE                             (0x4003C000UL) /* LSCRP Base Address */
#define FM4_LSCRP_BASE                            (0x4003C000UL) /* LSCRP Base Address */
#define FM_LVD_BASE                               (0x40035000UL) /* LVD Base Address */
