mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/common/s6e2c2xh.h
#define FM_MFS15_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS15_UART                            ((FM_MFS_UART_TypeDef *)FM4_MFS15_BASE)
#define FM_MFS15_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS15_BASE)
#define FM4_MFS2                                  ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2                                   ((FM_MFS_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS2_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM_MFS2_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS2_BASE)
#define FM4_MFS3                                  ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3                                   ((FM_MFS_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS3_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM_MFS3_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS3_BASE)
#define FM4_MFS4                                  ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4                                   ((FM_MFS_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS4_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM_MFS4_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS4_BASE)
#define FM4_MFS5                                  ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5                                   ((FM_MFS_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS5_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
#define FM_MFS5_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS5_BASE)
#define FM4_MFS6                                  ((FM_MFS_TypeDef *)FM4_MFS6_BASE)
#define FM_MFS6                                   ((FM_MFS_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS6_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS6_BASE)
#define FM_MFS6_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS6_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS6_BASE)
#define FM_MFS6_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS6_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS6_BASE)
#define FM_MFS6_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS6_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS6_BASE)
#define FM_MFS6_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS6_BASE)
#define FM4_MFS7                                  ((FM_MFS_TypeDef *)FM4_MFS7_BASE)
#define FM_MFS7                                   ((FM_MFS_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS7_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS7_BASE)
#define FM_MFS7_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS7_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS7_BASE)
#define FM_MFS7_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS7_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS7_BASE)
#define FM_MFS7_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS7_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS7_BASE)
#define FM_MFS7_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS7_BASE)
#define FM4_MFS8                                  ((FM_MFS_TypeDef *)FM4_MFS8_BASE)
#define FM_MFS8                                   ((FM_MFS_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS8_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS8_BASE)
#define FM_MFS8_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS8_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS8_BASE)
#define FM_MFS8_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS8_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS8_BASE)
#define FM_MFS8_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS8_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS8_BASE)
#define FM_MFS8_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS8_BASE)
#define FM4_MFS9                                  ((FM_MFS_TypeDef *)FM4_MFS9_BASE)
#define FM_MFS9                                   ((FM_MFS_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS9_CSIO                             ((FM_MFS_CSIO_TypeDef *)FM4_MFS9_BASE)
#define FM_MFS9_CSIO                              ((FM_MFS_CSIO_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS9_I2C                              ((FM_MFS_I2C_TypeDef *)FM4_MFS9_BASE)
#define FM_MFS9_I2C                               ((FM_MFS_I2C_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS9_LIN                              ((FM_MFS_LIN_TypeDef *)FM4_MFS9_BASE)
#define FM_MFS9_LIN                               ((FM_MFS_LIN_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFS9_UART                             ((FM_MFS_UART_TypeDef *)FM4_MFS9_BASE)
#define FM_MFS9_UART                              ((FM_MFS_UART_TypeDef *)FM4_MFS9_BASE)
#define FM4_MFT_PPG                               ((FM_MFT_PPG_TypeDef *)FM4_MFT_PPG_BASE)
#define FM_MFT_PPG                                ((FM_MFT_PPG_TypeDef *)FM4_MFT_PPG_BASE)
#define FM4_MFT0                                  ((FM_MFT_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0                                   ((FM_MFT_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_FRT                              ((FM_MFT_FRT_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_FRT                               ((FM_MFT_FRT_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_ICU                              ((FM_MFT_ICU_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_ICU                               ((FM_MFT_ICU_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_OCU                              ((FM_MFT_OCU_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_OCU                               ((FM_MFT_OCU_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT0_WFG                              ((FM_MFT_WFG_TypeDef *)FM4_MFT0_BASE)
#define FM_MFT0_WFG                               ((FM_MFT_WFG_TypeDef *)FM4_MFT0_BASE)
#define FM4_MFT1                                  ((FM_MFT_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1                                   ((FM_MFT_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_FRT                              ((FM_MFT_FRT_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_FRT                               ((FM_MFT_FRT_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_ICU                              ((FM_MFT_ICU_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_ICU                               ((FM_MFT_ICU_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_OCU                              ((FM_MFT_OCU_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_OCU                               ((FM_MFT_OCU_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT1_WFG                              ((FM_MFT_WFG_TypeDef *)FM4_MFT1_BASE)
#define FM_MFT1_WFG                               ((FM_MFT_WFG_TypeDef *)FM4_MFT1_BASE)
#define FM4_MFT2                                  ((FM_MFT_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2                                   ((FM_MFT_TypeDef *)FM4_MFT2_BASE)
#define FM4_MFT2_ADCMP                            ((FM_MFT_ADCMP_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2_ADCMP                             ((FM_MFT_ADCMP_TypeDef *)FM4_MFT2_BASE)
#define FM4_MFT2_FRT                              ((FM_MFT_FRT_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2_FRT                               ((FM_MFT_FRT_TypeDef *)FM4_MFT2_BASE)
#define FM4_MFT2_ICU                              ((FM_MFT_ICU_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2_ICU                               ((FM_MFT_ICU_TypeDef *)FM4_MFT2_BASE)
#define FM4_MFT2_OCU                              ((FM_MFT_OCU_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2_OCU                               ((FM_MFT_OCU_TypeDef *)FM4_MFT2_BASE)
#define FM4_MFT2_WFG                              ((FM_MFT_WFG_TypeDef *)FM4_MFT2_BASE)
#define FM_MFT2_WFG                               ((FM_MFT_WFG_TypeDef *)FM4_MFT2_BASE)
#define FM4_PCRC                                  ((FM_PCRC_TypeDef *)FM4_PCRC_BASE)
#define FM_PCRC                                   ((FM_PCRC_TypeDef *)FM4_PCRC_BASE)
#define FM4_QPRC0                                 ((FM_QPRC_TypeDef *)FM4_QPRC0_BASE)
#define FM_QPRC0                                  ((FM_QPRC_TypeDef *)FM4_QPRC0_BASE)
#define FM4_QPRC0_NF                              ((FM_QPRC_NF_TypeDef *)FM4_QPRC0_NF_BASE)
#define FM_QPRC0_NF                               ((FM_QPRC_NF_TypeDef *)FM4_QPRC0_NF_BASE)
#define FM4_QPRC1                                 ((FM_QPRC_TypeDef *)FM4_QPRC1_BASE)
#define FM_QPRC1                                  ((FM_QPRC_TypeDef *)FM4_QPRC1_BASE)
#define FM4_QPRC1_NF                              ((FM_QPRC_NF_TypeDef *)FM4_QPRC1_NF_BASE)
#define FM_QPRC1_NF                               ((FM_QPRC_NF_TypeDef *)FM4_QPRC1_NF_BASE)
#define FM4_QPRC2                                 ((FM_QPRC_TypeDef *)FM4_QPRC2_BASE)
#define FM_QPRC2                                  ((FM_QPRC_TypeDef *)FM4_QPRC2_BASE)
#define FM4_QPRC2_NF                              ((FM_QPRC_NF_TypeDef *)FM4_QPRC2_NF_BASE)
#define FM_QPRC2_NF                               ((FM_QPRC_NF_TypeDef *)FM4_QPRC2_NF_BASE)
#define FM4_QPRC3                                 ((FM_QPRC_TypeDef *)FM4_QPRC3_BASE)
#define FM_QPRC3                                  ((FM_QPRC_TypeDef *)FM4_QPRC3_BASE)
#define FM4_QPRC3_NF                              ((FM_QPRC_NF_TypeDef *)FM4_QPRC3_NF_BASE)
#define FM_QPRC3_NF                               ((FM_QPRC_NF_TypeDef *)FM4_QPRC3_NF_BASE)
#define FM4_RTC                                   ((FM_RTC_TypeDef *)FM4_RTC_BASE)
#define FM_RTC                                    ((FM_RTC_TypeDef *)FM4_RTC_BASE)
#define FM4_SBSSR                                 ((FM_SBSSR_TypeDef *)FM4_SBSSR_BASE)
#define FM_SBSSR                                  ((FM_SBSSR_TypeDef *)FM4_SBSSR_BASE)
#define FM4_SDIF                                  ((FM_SDIF_TypeDef *)FM4_SDIF_BASE)
#define FM_SDIF                                   ((FM_SDIF_TypeDef *)FM4_SDIF_BASE)
#define FM4_SWWDT                                 ((FM_SWWDT_TypeDef *)FM4_SWWDT_BASE)
#define FM_SWWDT                                  ((FM_SWWDT_TypeDef *)FM4_SWWDT_BASE)
#define FM4_UNIQUE_ID                             ((FM_UNIQUE_ID_TypeDef *)FM4_UNIQUE_ID_BASE)
#define FM_UNIQUE_ID                              ((FM_UNIQUE_ID_TypeDef *)FM4_UNIQUE_ID_BASE)
#define FM4_USB0                                  ((FM_USB_TypeDef *)FM4_USB0_BASE)
#define FM_USB0                                   ((FM_USB_TypeDef *)FM4_USB0_BASE)
#define FM4_USB1                                  ((FM_USB_TypeDef *)FM4_USB1_BASE)
#define FM_USB1                                   ((FM_USB_TypeDef *)FM4_USB1_BASE)
#define FM4_USBETHERCLK                           ((FM_USBETHERCLK_TypeDef *)FM4_USBETHERCLK_BASE)
#define FM_USBETHERCLK                            ((FM_USBETHERCLK_TypeDef *)FM4_USBETHERCLK_BASE)
#define FM4_WC                                    ((FM_WC_TypeDef *)FM4_WC_BASE)
#define FM_WC                                     ((FM_WC_TypeDef *)FM4_WC_BASE)
/*******************************************************************************
* Register Definitions
*******************************************************************************/
/*******************************************************************************
* ADC Registers ADC0
*   Register Definition
*******************************************************************************/
#define FM_ADC0_ADSR                              *((volatile  uint8_t*)(0x40027000UL))
#define FM4_ADC0_ADSR                             *((volatile  uint8_t*)(0x40027000UL))
#define FM_ADC0_ADCR                              *((volatile  uint8_t*)(0x40027001UL))
#define FM4_ADC0_ADCR                             *((volatile  uint8_t*)(0x40027001UL))
#define FM_ADC0_SFNS                              *((volatile  uint8_t*)(0x40027008UL))
#define FM4_ADC0_SFNS                             *((volatile  uint8_t*)(0x40027008UL))
#define FM_ADC0_SCCR                              *((volatile  uint8_t*)(0x40027009UL))
#define FM4_ADC0_SCCR                             *((volatile  uint8_t*)(0x40027009UL))
#define FM_ADC0_SCFD                              *((volatile uint32_t*)(0x4002700CUL))
#define FM4_ADC0_SCFD                             *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCFD_FDAS1                        *((volatile uint32_t*)(0x4002700CUL))
#define FM4_ADC0_SCFD_FDAS1                       *((volatile uint32_t*)(0x4002700CUL))
#define FM_ADC0_SCIS23                            *((volatile uint16_t*)(0x40027010UL))
#define FM4_ADC0_SCIS23                           *((volatile uint16_t*)(0x40027010UL))
#define FM_ADC0_SCIS01                            *((volatile uint16_t*)(0x40027014UL))
#define FM4_ADC0_SCIS01                           *((volatile uint16_t*)(0x40027014UL))
#define FM_ADC0_PFNS                              *((volatile  uint8_t*)(0x40027018UL))
#define FM4_ADC0_PFNS                             *((volatile  uint8_t*)(0x40027018UL))
#define FM_ADC0_PCCR                              *((volatile  uint8_t*)(0x40027019UL))
#define FM4_ADC0_PCCR                             *((volatile  uint8_t*)(0x40027019UL))
#define FM_ADC0_PCFD                              *((volatile uint32_t*)(0x4002701CUL))
#define FM4_ADC0_PCFD                             *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCFD_FDAS1                        *((volatile uint32_t*)(0x4002701CUL))
#define FM4_ADC0_PCFD_FDAS1                       *((volatile uint32_t*)(0x4002701CUL))
#define FM_ADC0_PCIS                              *((volatile  uint8_t*)(0x40027020UL))
#define FM4_ADC0_PCIS                             *((volatile  uint8_t*)(0x40027020UL))
#define FM_ADC0_CMPCR                             *((volatile  uint8_t*)(0x40027024UL))
#define FM4_ADC0_CMPCR                            *((volatile  uint8_t*)(0x40027024UL))
#define FM_ADC0_CMPD                              *((volatile uint16_t*)(0x40027026UL))
#define FM4_ADC0_CMPD                             *((volatile uint16_t*)(0x40027026UL))
#define FM_ADC0_ADSS23                            *((volatile uint16_t*)(0x40027028UL))
#define FM4_ADC0_ADSS23                           *((volatile uint16_t*)(0x40027028UL))
#define FM_ADC0_ADSS01                            *((volatile uint16_t*)(0x4002702CUL))
#define FM4_ADC0_ADSS01                           *((volatile uint16_t*)(0x4002702CUL))
#define FM_ADC0_ADST01                            *((volatile uint16_t*)(0x40027030UL))
#define FM4_ADC0_ADST01                           *((volatile uint16_t*)(0x40027030UL))
#define FM_ADC0_ADCT                              *((volatile  uint8_t*)(0x40027034UL))
#define FM4_ADC0_ADCT                             *((volatile  uint8_t*)(0x40027034UL))
#define FM_ADC0_PRTSL                             *((volatile  uint8_t*)(0x40027038UL))
#define FM4_ADC0_PRTSL                            *((volatile  uint8_t*)(0x40027038UL))
#define FM_ADC0_SCTSL                             *((volatile  uint8_t*)(0x40027039UL))
#define FM4_ADC0_SCTSL                            *((volatile  uint8_t*)(0x40027039UL))
#define FM_ADC0_ADCEN                             *((volatile uint16_t*)(0x4002703CUL))
#define FM4_ADC0_ADCEN                            *((volatile uint16_t*)(0x4002703CUL))
#define FM_ADC0_CALSR                             *((volatile uint32_t*)(0x40027040UL))
#define FM4_ADC0_CALSR                            *((volatile uint32_t*)(0x40027040UL))
#define FM_ADC0_WCMRCOT                           *((volatile  uint8_t*)(0x40027044UL))
#define FM4_ADC0_WCMRCOT                          *((volatile  uint8_t*)(0x40027044UL))
#define FM_ADC0_WCMRCIF                           *((volatile  uint8_t*)(0x40027048UL))
#define FM4_ADC0_WCMRCIF                          *((volatile  uint8_t*)(0x40027048UL))
#define FM_ADC0_WCMPCR                            *((volatile  uint8_t*)(0x4002704CUL))
#define FM4_ADC0_WCMPCR                           *((volatile  uint8_t*)(0x4002704CUL))
#define FM_ADC0_WCMPSR                            *((volatile  uint8_t*)(0x4002704DUL))
#define FM4_ADC0_WCMPSR                           *((volatile  uint8_t*)(0x4002704DUL))
#define FM_ADC0_WCMPDL                            *((volatile uint16_t*)(0x40027050UL))
#define FM4_ADC0_WCMPDL                           *((volatile uint16_t*)(0x40027050UL))
#define FM_ADC0_WCMPDH                            *((volatile uint16_t*)(0x40027052UL))
#define FM4_ADC0_WCMPDH                           *((volatile uint16_t*)(0x40027052UL))

