mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/common/s6e2c2xh.h
/*******************************************************************************
* MFS Registers MFS13
*   Register Definition
*******************************************************************************/
#define FM_MFS13_CSIO_SMR                         *((volatile  uint8_t*)(0x40038D00UL))
#define FM4_MFS13_CSIO_SMR                        *((volatile  uint8_t*)(0x40038D00UL))
#define FM_MFS13_I2C_SMR                          *((volatile  uint8_t*)(0x40038D00UL))
#define FM4_MFS13_I2C_SMR                         *((volatile  uint8_t*)(0x40038D00UL))
#define FM_MFS13_LIN_SMR                          *((volatile  uint8_t*)(0x40038D00UL))
#define FM4_MFS13_LIN_SMR                         *((volatile  uint8_t*)(0x40038D00UL))
#define FM_MFS13_UART_SMR                         *((volatile  uint8_t*)(0x40038D00UL))
#define FM4_MFS13_UART_SMR                        *((volatile  uint8_t*)(0x40038D00UL))
#define FM_MFS13_CSIO_SCR                         *((volatile  uint8_t*)(0x40038D01UL))
#define FM4_MFS13_CSIO_SCR                        *((volatile  uint8_t*)(0x40038D01UL))
#define FM_MFS13_I2C_IBCR                         *((volatile  uint8_t*)(0x40038D01UL))
#define FM4_MFS13_I2C_IBCR                        *((volatile  uint8_t*)(0x40038D01UL))
#define FM_MFS13_LIN_SCR                          *((volatile  uint8_t*)(0x40038D01UL))
#define FM4_MFS13_LIN_SCR                         *((volatile  uint8_t*)(0x40038D01UL))
#define FM_MFS13_UART_SCR                         *((volatile  uint8_t*)(0x40038D01UL))
#define FM4_MFS13_UART_SCR                        *((volatile  uint8_t*)(0x40038D01UL))
#define FM_MFS13_CSIO_ESCR                        *((volatile  uint8_t*)(0x40038D04UL))
#define FM4_MFS13_CSIO_ESCR                       *((volatile  uint8_t*)(0x40038D04UL))
#define FM_MFS13_I2C_IBSR                         *((volatile  uint8_t*)(0x40038D04UL))
#define FM4_MFS13_I2C_IBSR                        *((volatile  uint8_t*)(0x40038D04UL))
#define FM_MFS13_LIN_ESCR                         *((volatile  uint8_t*)(0x40038D04UL))
#define FM4_MFS13_LIN_ESCR                        *((volatile  uint8_t*)(0x40038D04UL))
#define FM_MFS13_UART_ESCR                        *((volatile  uint8_t*)(0x40038D04UL))
#define FM4_MFS13_UART_ESCR                       *((volatile  uint8_t*)(0x40038D04UL))
#define FM_MFS13_CSIO_SSR                         *((volatile  uint8_t*)(0x40038D05UL))
#define FM4_MFS13_CSIO_SSR                        *((volatile  uint8_t*)(0x40038D05UL))
#define FM_MFS13_I2C_SSR                          *((volatile  uint8_t*)(0x40038D05UL))
#define FM4_MFS13_I2C_SSR                         *((volatile  uint8_t*)(0x40038D05UL))
#define FM_MFS13_LIN_SSR                          *((volatile  uint8_t*)(0x40038D05UL))
#define FM4_MFS13_LIN_SSR                         *((volatile  uint8_t*)(0x40038D05UL))
#define FM_MFS13_UART_SSR                         *((volatile  uint8_t*)(0x40038D05UL))
#define FM4_MFS13_UART_SSR                        *((volatile  uint8_t*)(0x40038D05UL))
#define FM_MFS13_CSIO_RDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_CSIO_RDR                        *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_CSIO_TDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_CSIO_TDR                        *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_I2C_RDR                          *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_I2C_RDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_I2C_TDR                          *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_I2C_TDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_LIN_RDR                          *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_LIN_RDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_LIN_TDR                          *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_LIN_TDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_UART_RDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_UART_RDR                        *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_UART_TDR                         *((volatile uint16_t*)(0x40038D08UL))
#define FM4_MFS13_UART_TDR                        *((volatile uint16_t*)(0x40038D08UL))
#define FM_MFS13_CSIO_BGR                         *((volatile uint16_t*)(0x40038D0CUL))
#define FM4_MFS13_CSIO_BGR                        *((volatile uint16_t*)(0x40038D0CUL))
#define FM_MFS13_I2C_BGR                          *((volatile uint16_t*)(0x40038D0CUL))
#define FM4_MFS13_I2C_BGR                         *((volatile uint16_t*)(0x40038D0CUL))
#define FM_MFS13_LIN_BGR                          *((volatile uint16_t*)(0x40038D0CUL))
#define FM4_MFS13_LIN_BGR                         *((volatile uint16_t*)(0x40038D0CUL))
#define FM_MFS13_UART_BGR                         *((volatile uint16_t*)(0x40038D0CUL))
#define FM4_MFS13_UART_BGR                        *((volatile uint16_t*)(0x40038D0CUL))
#define FM_MFS13_I2C_ISBA                         *((volatile  uint8_t*)(0x40038D10UL))
#define FM4_MFS13_I2C_ISBA                        *((volatile  uint8_t*)(0x40038D10UL))
#define FM_MFS13_I2C_ISMK                         *((volatile  uint8_t*)(0x40038D11UL))
#define FM4_MFS13_I2C_ISMK                        *((volatile  uint8_t*)(0x40038D11UL))
#define FM_MFS13_CSIO_FCR                         *((volatile uint16_t*)(0x40038D14UL))
#define FM4_MFS13_CSIO_FCR                        *((volatile uint16_t*)(0x40038D14UL))
#define FM_MFS13_I2C_FCR                          *((volatile uint16_t*)(0x40038D14UL))
#define FM4_MFS13_I2C_FCR                         *((volatile uint16_t*)(0x40038D14UL))
#define FM_MFS13_LIN_FCR                          *((volatile uint16_t*)(0x40038D14UL))
#define FM4_MFS13_LIN_FCR                         *((volatile uint16_t*)(0x40038D14UL))
#define FM_MFS13_UART_FCR                         *((volatile uint16_t*)(0x40038D14UL))
#define FM4_MFS13_UART_FCR                        *((volatile uint16_t*)(0x40038D14UL))
#define FM_MFS13_CSIO_FBYTE1                      *((volatile  uint8_t*)(0x40038D18UL))
#define FM4_MFS13_CSIO_FBYTE1                     *((volatile  uint8_t*)(0x40038D18UL))
#define FM_MFS13_I2C_FBYTE1                       *((volatile  uint8_t*)(0x40038D18UL))
#define FM4_MFS13_I2C_FBYTE1                      *((volatile  uint8_t*)(0x40038D18UL))
#define FM_MFS13_LIN_FBYTE1                       *((volatile  uint8_t*)(0x40038D18UL))
#define FM4_MFS13_LIN_FBYTE1                      *((volatile  uint8_t*)(0x40038D18UL))
#define FM_MFS13_UART_FBYTE1                      *((volatile  uint8_t*)(0x40038D18UL))
#define FM4_MFS13_UART_FBYTE1                     *((volatile  uint8_t*)(0x40038D18UL))
#define FM_MFS13_CSIO_FBYTE2                      *((volatile  uint8_t*)(0x40038D19UL))
#define FM4_MFS13_CSIO_FBYTE2                     *((volatile  uint8_t*)(0x40038D19UL))
#define FM_MFS13_I2C_FBYTE2                       *((volatile  uint8_t*)(0x40038D19UL))
#define FM4_MFS13_I2C_FBYTE2                      *((volatile  uint8_t*)(0x40038D19UL))
#define FM_MFS13_LIN_FBYTE2                       *((volatile  uint8_t*)(0x40038D19UL))
#define FM4_MFS13_LIN_FBYTE2                      *((volatile  uint8_t*)(0x40038D19UL))
#define FM_MFS13_UART_FBYTE2                      *((volatile  uint8_t*)(0x40038D19UL))
#define FM4_MFS13_UART_FBYTE2                     *((volatile  uint8_t*)(0x40038D19UL))
#define FM_MFS13_CSIO_SCSTR0                      *((volatile  uint8_t*)(0x40038D1CUL))
#define FM4_MFS13_CSIO_SCSTR0                     *((volatile  uint8_t*)(0x40038D1CUL))
#define FM_MFS13_I2C_NFCR                         *((volatile  uint8_t*)(0x40038D1CUL))
#define FM4_MFS13_I2C_NFCR                        *((volatile  uint8_t*)(0x40038D1CUL))
#define FM_MFS13_CSIO_SCSTR1                      *((volatile  uint8_t*)(0x40038D1DUL))
#define FM4_MFS13_CSIO_SCSTR1                     *((volatile  uint8_t*)(0x40038D1DUL))
#define FM_MFS13_I2C_EIBCR                        *((volatile  uint8_t*)(0x40038D1DUL))
#define FM4_MFS13_I2C_EIBCR                       *((volatile  uint8_t*)(0x40038D1DUL))
#define FM_MFS13_CSIO_SCSTR32                     *((volatile uint16_t*)(0x40038D20UL))
#define FM4_MFS13_CSIO_SCSTR32                    *((volatile uint16_t*)(0x40038D20UL))
#define FM_MFS13_CSIO_SACSR                       *((volatile uint16_t*)(0x40038D24UL))
#define FM4_MFS13_CSIO_SACSR                      *((volatile uint16_t*)(0x40038D24UL))
#define FM_MFS13_CSIO_STMR                        *((volatile uint16_t*)(0x40038D28UL))
#define FM4_MFS13_CSIO_STMR                       *((volatile uint16_t*)(0x40038D28UL))
#define FM_MFS13_CSIO_STMCR                       *((volatile uint16_t*)(0x40038D2CUL))
#define FM4_MFS13_CSIO_STMCR                      *((volatile uint16_t*)(0x40038D2CUL))
#define FM_MFS13_CSIO_SCSCR                       *((volatile uint16_t*)(0x40038D30UL))
#define FM4_MFS13_CSIO_SCSCR                      *((volatile uint16_t*)(0x40038D30UL))
#define FM_MFS13_CSIO_SCSFR0                      *((volatile  uint8_t*)(0x40038D34UL))
#define FM4_MFS13_CSIO_SCSFR0                     *((volatile  uint8_t*)(0x40038D34UL))
#define FM_MFS13_CSIO_SCSFR1                      *((volatile  uint8_t*)(0x40038D35UL))
#define FM4_MFS13_CSIO_SCSFR1                     *((volatile  uint8_t*)(0x40038D35UL))
#define FM_MFS13_CSIO_SCSFR2                      *((volatile  uint8_t*)(0x40038D38UL))
#define FM4_MFS13_CSIO_SCSFR2                     *((volatile  uint8_t*)(0x40038D38UL))
#define FM_MFS13_CSIO_TBYTE0                      *((volatile  uint8_t*)(0x40038D3CUL))
#define FM4_MFS13_CSIO_TBYTE0                     *((volatile  uint8_t*)(0x40038D3CUL))
#define FM_MFS13_CSIO_TBYTE1                      *((volatile  uint8_t*)(0x40038D3DUL))
#define FM4_MFS13_CSIO_TBYTE1                     *((volatile  uint8_t*)(0x40038D3DUL))
#define FM_MFS13_CSIO_TBYTE2                      *((volatile  uint8_t*)(0x40038D40UL))
#define FM4_MFS13_CSIO_TBYTE2                     *((volatile  uint8_t*)(0x40038D40UL))
#define FM_MFS13_CSIO_TBYTE3                      *((volatile  uint8_t*)(0x40038D41UL))
#define FM4_MFS13_CSIO_TBYTE3                     *((volatile  uint8_t*)(0x40038D41UL))

