mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xh/common/s6e2c2xh.h
#define bFM_GPIO_PDORA_P0                         *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM4_GPIO_PDORA_P0                        *((volatile  uint8_t *)(0x42DE8500UL))
#define bFM_GPIO_PDORA_P1                         *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM4_GPIO_PDORA_P1                        *((volatile  uint8_t *)(0x42DE8504UL))
#define bFM_GPIO_PDORA_P2                         *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM4_GPIO_PDORA_P2                        *((volatile  uint8_t *)(0x42DE8508UL))
#define bFM_GPIO_PDORA_P3                         *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM4_GPIO_PDORA_P3                        *((volatile  uint8_t *)(0x42DE850CUL))
#define bFM_GPIO_PDORA_P4                         *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM4_GPIO_PDORA_P4                        *((volatile  uint8_t *)(0x42DE8510UL))
#define bFM_GPIO_PDORA_P5                         *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM4_GPIO_PDORA_P5                        *((volatile  uint8_t *)(0x42DE8514UL))
#define bFM_GPIO_PDORA_P6                         *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM4_GPIO_PDORA_P6                        *((volatile  uint8_t *)(0x42DE8518UL))
#define bFM_GPIO_PDORA_P7                         *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM4_GPIO_PDORA_P7                        *((volatile  uint8_t *)(0x42DE851CUL))
#define bFM_GPIO_PDORA_P8                         *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM4_GPIO_PDORA_P8                        *((volatile  uint8_t *)(0x42DE8520UL))
#define bFM_GPIO_PDORA_P9                         *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM4_GPIO_PDORA_P9                        *((volatile  uint8_t *)(0x42DE8524UL))
#define bFM_GPIO_PDORA_PA                         *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM4_GPIO_PDORA_PA                        *((volatile  uint8_t *)(0x42DE8528UL))
#define bFM_GPIO_PDORA_PB                         *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM4_GPIO_PDORA_PB                        *((volatile  uint8_t *)(0x42DE852CUL))
#define bFM_GPIO_PDORA_PC                         *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM4_GPIO_PDORA_PC                        *((volatile  uint8_t *)(0x42DE8530UL))
#define bFM_GPIO_PDORA_PD                         *((volatile  uint8_t *)(0x42DE8534UL))
#define bFM4_GPIO_PDORA_PD                        *((volatile  uint8_t *)(0x42DE8534UL))
#define bFM_GPIO_PDORA_PE                         *((volatile  uint8_t *)(0x42DE8538UL))
#define bFM4_GPIO_PDORA_PE                        *((volatile  uint8_t *)(0x42DE8538UL))
#define bFM_GPIO_PDORA_PF                         *((volatile  uint8_t *)(0x42DE853CUL))
#define bFM4_GPIO_PDORA_PF                        *((volatile  uint8_t *)(0x42DE853CUL))

#define bFM_GPIO_PDORC_P0                         *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM4_GPIO_PDORC_P0                        *((volatile  uint8_t *)(0x42DE8600UL))
#define bFM_GPIO_PDORC_P1                         *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM4_GPIO_PDORC_P1                        *((volatile  uint8_t *)(0x42DE8604UL))
#define bFM_GPIO_PDORC_P2                         *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM4_GPIO_PDORC_P2                        *((volatile  uint8_t *)(0x42DE8608UL))
#define bFM_GPIO_PDORC_P3                         *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM4_GPIO_PDORC_P3                        *((volatile  uint8_t *)(0x42DE860CUL))
#define bFM_GPIO_PDORC_P4                         *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM4_GPIO_PDORC_P4                        *((volatile  uint8_t *)(0x42DE8610UL))
#define bFM_GPIO_PDORC_P5                         *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM4_GPIO_PDORC_P5                        *((volatile  uint8_t *)(0x42DE8614UL))
#define bFM_GPIO_PDORC_P6                         *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM4_GPIO_PDORC_P6                        *((volatile  uint8_t *)(0x42DE8618UL))
#define bFM_GPIO_PDORC_P7                         *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM4_GPIO_PDORC_P7                        *((volatile  uint8_t *)(0x42DE861CUL))
#define bFM_GPIO_PDORC_P8                         *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM4_GPIO_PDORC_P8                        *((volatile  uint8_t *)(0x42DE8620UL))
#define bFM_GPIO_PDORC_P9                         *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM4_GPIO_PDORC_P9                        *((volatile  uint8_t *)(0x42DE8624UL))
#define bFM_GPIO_PDORC_PA                         *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM4_GPIO_PDORC_PA                        *((volatile  uint8_t *)(0x42DE8628UL))
#define bFM_GPIO_PDORC_PB                         *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM4_GPIO_PDORC_PB                        *((volatile  uint8_t *)(0x42DE862CUL))
#define bFM_GPIO_PDORC_PC                         *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM4_GPIO_PDORC_PC                        *((volatile  uint8_t *)(0x42DE8630UL))
#define bFM_GPIO_PDORC_PD                         *((volatile  uint8_t *)(0x42DE8634UL))
#define bFM4_GPIO_PDORC_PD                        *((volatile  uint8_t *)(0x42DE8634UL))
#define bFM_GPIO_PDORC_PE                         *((volatile  uint8_t *)(0x42DE8638UL))
#define bFM4_GPIO_PDORC_PE                        *((volatile  uint8_t *)(0x42DE8638UL))
#define bFM_GPIO_PDORC_PF                         *((volatile  uint8_t *)(0x42DE863CUL))
#define bFM4_GPIO_PDORC_PF                        *((volatile  uint8_t *)(0x42DE863CUL))

#define bFM_GPIO_PDORD_P0                         *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM4_GPIO_PDORD_P0                        *((volatile  uint8_t *)(0x42DE8680UL))
#define bFM_GPIO_PDORD_P1                         *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM4_GPIO_PDORD_P1                        *((volatile  uint8_t *)(0x42DE8684UL))
#define bFM_GPIO_PDORD_P2                         *((volatile  uint8_t *)(0x42DE8688UL))
#define bFM4_GPIO_PDORD_P2                        *((volatile  uint8_t *)(0x42DE8688UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM4_GPIO_PDORE_P0                        *((volatile  uint8_t *)(0x42DE8700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM4_GPIO_PDORE_P2                        *((volatile  uint8_t *)(0x42DE8708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x42DE870CUL))
#define bFM4_GPIO_PDORE_P3                        *((volatile  uint8_t *)(0x42DE870CUL))

#define bFM_GPIO_PDSR0_P0                         *((volatile  uint8_t *)(0x42DEE800UL))
#define bFM4_GPIO_PDSR0_P0                        *((volatile  uint8_t *)(0x42DEE800UL))
#define bFM_GPIO_PDSR0_P1                         *((volatile  uint8_t *)(0x42DEE804UL))
#define bFM4_GPIO_PDSR0_P1                        *((volatile  uint8_t *)(0x42DEE804UL))
#define bFM_GPIO_PDSR0_P2                         *((volatile  uint8_t *)(0x42DEE808UL))
#define bFM4_GPIO_PDSR0_P2                        *((volatile  uint8_t *)(0x42DEE808UL))
#define bFM_GPIO_PDSR0_P3                         *((volatile  uint8_t *)(0x42DEE80CUL))
#define bFM4_GPIO_PDSR0_P3                        *((volatile  uint8_t *)(0x42DEE80CUL))
#define bFM_GPIO_PDSR0_P4                         *((volatile  uint8_t *)(0x42DEE810UL))
#define bFM4_GPIO_PDSR0_P4                        *((volatile  uint8_t *)(0x42DEE810UL))
#define bFM_GPIO_PDSR0_P8                         *((volatile  uint8_t *)(0x42DEE820UL))
#define bFM4_GPIO_PDSR0_P8                        *((volatile  uint8_t *)(0x42DEE820UL))
#define bFM_GPIO_PDSR0_P9                         *((volatile  uint8_t *)(0x42DEE824UL))
#define bFM4_GPIO_PDSR0_P9                        *((volatile  uint8_t *)(0x42DEE824UL))
#define bFM_GPIO_PDSR0_PA                         *((volatile  uint8_t *)(0x42DEE828UL))
#define bFM4_GPIO_PDSR0_PA                        *((volatile  uint8_t *)(0x42DEE828UL))

